In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [48]:
%matplotlib inline

In [44]:
gdp_df = pd.read_csv("../Data/gdp_percapita.csv", nrows=6869)

In [46]:
internet_df = pd.read_csv("../Data/internet_use.csv", nrows=4496)

In [19]:
gdp_df = pd.read_csv("../Data/gdp_percapita.csv", nrows=6868)

In [20]:
internet_df = pd.read_csv("../Data/internet_use.csv", nrows=4495)

In [11]:
gdp_df.head(n=7)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN

In [12]:
internet_df.head(7)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN
6     Afghanistan  2008  1.840000              NaN

Look at the shape of each DataFrame - how many rows? How many columns?

In [13]:
gdp_df.shape

(6869, 4)

In [14]:
internet_df.shape

(4496, 4)

Take a look at the datatypes for the columns in each DataFrame.

In [15]:
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [16]:
internet_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

9. Take a look at the last 10 rows of each DataFrame in turn.

In [17]:
gdp_df.tail(10)

     Country or Area      Year        Value  Value Footnotes
6859        Zimbabwe      1998  3653.920016              NaN
6860        Zimbabwe      1997  3580.048793              NaN
6861        Zimbabwe      1996  3520.430146              NaN
6862        Zimbabwe      1995  3226.413930              NaN
6863        Zimbabwe      1994  3263.934978              NaN
6864        Zimbabwe      1993  3033.504852              NaN
6865        Zimbabwe      1992  3054.889178              NaN
6866        Zimbabwe      1991  3426.598094              NaN
6867        Zimbabwe      1990  3324.348171              NaN
6868   footnoteSeqID  Footnote          NaN              NaN

In [18]:
internet_df.tail(10)

     Country or Area      Year     Value  Value Footnotes
4486        Zimbabwe      2001  0.799846              NaN
4487        Zimbabwe      2000  0.401434              NaN
4488        Zimbabwe      1999  0.161676              NaN
4489        Zimbabwe      1998  0.081648              NaN
4490        Zimbabwe      1997  0.033080              NaN
4491        Zimbabwe      1996  0.016790              NaN
4492        Zimbabwe      1995  0.007684              NaN
4493        Zimbabwe      1994  0.001739              NaN
4494        Zimbabwe      1990  0.000000              NaN
4495   footnoteSeqID  Footnote       NaN              NaN

10. Drop the value footnotes column from both DataFrames. Check that this worked as expected

In [21]:
gdp_df.drop('Value Footnotes', inplace=True, axis=1)

In [22]:
gdp_df.tail(10)

     Country or Area  Year        Value
6858        Zimbabwe  1999  3600.849291
6859        Zimbabwe  1998  3653.920016
6860        Zimbabwe  1997  3580.048793
6861        Zimbabwe  1996  3520.430146
6862        Zimbabwe  1995  3226.413930
6863        Zimbabwe  1994  3263.934978
6864        Zimbabwe  1993  3033.504852
6865        Zimbabwe  1992  3054.889178
6866        Zimbabwe  1991  3426.598094
6867        Zimbabwe  1990  3324.348171

In [23]:
internet_df.drop('Value Footnotes', inplace=True, axis=1)

In [24]:
internet_df.tail(10)

     Country or Area  Year     Value
4485        Zimbabwe  2002  3.994356
4486        Zimbabwe  2001  0.799846
4487        Zimbabwe  2000  0.401434
4488        Zimbabwe  1999  0.161676
4489        Zimbabwe  1998  0.081648
4490        Zimbabwe  1997  0.033080
4491        Zimbabwe  1996  0.016790
4492        Zimbabwe  1995  0.007684
4493        Zimbabwe  1994  0.001739
4494        Zimbabwe  1990  0.000000

11. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [25]:
gdp_df = gdp_df.rename(columns={'Country or Area': 'Country', 'Value': 'GDP_Per_Capita'})

In [26]:
gdp_df.tail(10)

       Country  Year  GDP_Per_Capita
6858  Zimbabwe  1999     3600.849291
6859  Zimbabwe  1998     3653.920016
6860  Zimbabwe  1997     3580.048793
6861  Zimbabwe  1996     3520.430146
6862  Zimbabwe  1995     3226.413930
6863  Zimbabwe  1994     3263.934978
6864  Zimbabwe  1993     3033.504852
6865  Zimbabwe  1992     3054.889178
6866  Zimbabwe  1991     3426.598094
6867  Zimbabwe  1990     3324.348171

12. Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [27]:
internet_df = internet_df.rename(columns={'Country or Area': 'Country', 'Value': 'Internet_Users_Pct'})

In [29]:
internet_df.tail(10)

       Country  Year  Internet_Users_Pct
4485  Zimbabwe  2002            3.994356
4486  Zimbabwe  2001            0.799846
4487  Zimbabwe  2000            0.401434
4488  Zimbabwe  1999            0.161676
4489  Zimbabwe  1998            0.081648
4490  Zimbabwe  1997            0.033080
4491  Zimbabwe  1996            0.016790
4492  Zimbabwe  1995            0.007684
4493  Zimbabwe  1994            0.001739
4494  Zimbabwe  1990            0.000000

13. Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use

In [42]:
gdp_and_internet_use= gdp_df.merge(internet_df, on=["Country","Year"])

display(gdp_and_internet_use)

          Country  Year  GDP_Per_Capita  Internet_Users_Pct
0     Afghanistan  2014     2102.385234            6.390000
1     Afghanistan  2013     2116.465454            5.900000
2     Afghanistan  2012     2075.491747            5.454545
3     Afghanistan  2011     1904.559799            5.000000
4     Afghanistan  2010     1957.029338            4.000000
...           ...   ...             ...                 ...
3453     Zimbabwe  1997     3580.048793            0.033080
3454     Zimbabwe  1996     3520.430146            0.016790
3455     Zimbabwe  1995     3226.413930            0.007684
3456     Zimbabwe  1994     3263.934978            0.001739
3457     Zimbabwe  1990     3324.348171            0.000000

[3458 rows x 4 columns]

14. Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [43]:
gdp_and_internet_use.shape

(3458, 4)

15. Look at the last five rows to make sure the data is clean and as expected

In [47]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2014     2102.385234            6.390000
1  Afghanistan  2013     2116.465454            5.900000
2  Afghanistan  2012     2075.491747            5.454545
3  Afghanistan  2011     1904.559799            5.000000
4  Afghanistan  2010     1957.029338            4.000000

16. Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly

In [54]:
gdp_and_internet_use = gdp_and_internet_use[gdp_and_internet_use["Year"].isin([2004,2009,2014])]

In [55]:
gdp_and_internet_use.head(10)

        Country  Year  GDP_Per_Capita  Internet_Users_Pct
0   Afghanistan  2014     2102.385234            6.390000
5   Afghanistan  2009     1758.904043            3.550000
10  Afghanistan  2004     1200.278256            0.105809
13      Albania  2014    11623.866679           60.100000
18      Albania  2009    10346.864199           41.200000
23      Albania  2004     7604.838002            2.420388
34      Algeria  2014    11512.705405           18.090000
39      Algeria  2009    10782.361398           11.230000
44      Algeria  2004    10058.435939            4.634475
56       Angola  2014     8239.828837           21.260000

17. Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.